In [1]:
import pandas as pd  
import numpy as np

/var/folders/2v/nsbsx6y90_9_6kks00t6shb80000gn/T/ipykernel_5855/2170618911.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
file1 = pd.read_csv("Data/file1.csv")

file2 = pd.read_csv("Data/file2.csv")

file3 = pd.read_csv("Data/file3.csv")

#file4 = pd.read_csv("Data/marketing_customer_analysis.csv")

In [3]:
file1.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [4]:
print (file1.shape)
print (file2.shape)
print (file3.shape)

(4008, 11)
(996, 11)
(7070, 11)

In [5]:
print (file1.columns)
print (file2.columns)
print (file3.columns)

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')
Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Total Claim Amount', 'Policy Type', 'Vehicle Class'],
      dtype='object')
Index(['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Total Claim Amount', 'Vehicle Class'],
      dtype='object')

In [6]:
def lowercase_columns (df):
    df.columns = [col.lower() for col in df.columns]

In [7]:
lowercase_columns(file1)
file1.columns

Index(['customer', 'st', 'gender', 'education', 'customer lifetime value',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'vehicle class', 'total claim amount'],
      dtype='object')

In [8]:
lowercase_columns(file2)
lowercase_columns(file3)

In [9]:
# rename column
file3 = file3.rename(columns={ 'state':'st',})
file3.columns

Index(['customer', 'st', 'customer lifetime value', 'education', 'gender',
       'income', 'monthly premium auto', 'number of open complaints',
       'policy type', 'total claim amount', 'vehicle class'],
      dtype='object')

In [10]:
column_names = file1.columns
data = pd.DataFrame(columns=column_names)

In [11]:
data = pd.concat([data,file1, file2, file3], axis=0)
data.shape

/var/folders/2v/nsbsx6y90_9_6kks00t6shb80000gn/T/ipykernel_5855/1298338656.py:1: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  data = pd.concat([data,file1, file2, file3], axis=0)

(12074, 11)

In [12]:
data._get_numeric_data().head() # numerical columns

    income  monthly premium auto  total claim amount
0      0.0                1000.0            2.704934
1      0.0                  94.0         1131.464935
2  48767.0                 108.0          566.472247
3      0.0                 106.0          529.881344
4  36357.0                  68.0           17.269323

In [63]:
data.select_dtypes('object').head(3) # original categorical columns

,customer,st,gender,education,number of open complaints,policy type,vehicle class
0,RB50392,Washington,NaN,Master,1/0/00,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,Bachelor,1/0/00,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,Bachelor,1/0/00,Personal Auto,Two-Door Car

In [14]:
data.dtypes

customer                      object
st                            object
gender                        object
education                     object
customer lifetime value       object
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
dtype: object

In [15]:
data.drop(['education', 'number of open complaints'], axis =1).shape

(12074, 9)

In [16]:
data['customer lifetime value'] = data['customer lifetime value'].apply(lambda x: str(x).replace('%', ''))

In [17]:
data['customer lifetime value'] = data['customer lifetime value'].astype(float)/100

In [62]:
data.head(3)

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,6979.5359,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,12887.4317,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

In [19]:
data.dtypes

customer                      object
st                            object
gender                        object
education                     object
customer lifetime value      float64
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
dtype: object

In [20]:
data.duplicated().sum()

2939

In [21]:
data.drop_duplicates()
data.shape

(12074, 11)

In [22]:
data_filtered = data[data['income'] > 0]
data_filtered.shape

(6843, 11)

In [23]:
data_filtered.isna().sum()

customer                      0
st                            0
gender                       98
education                     0
customer lifetime value       5
income                        0
monthly premium auto          0
number of open complaints     0
policy type                   0
vehicle class                 0
total claim amount            0
dtype: int64

In [24]:
round(data_filtered.isna().sum()/len(data_filtered),4)*100

customer                     0.00
st                           0.00
gender                       1.43
education                    0.00
customer lifetime value      0.07
income                       0.00
monthly premium auto         0.00
number of open complaints    0.00
policy type                  0.00
vehicle class                0.00
total claim amount           0.00
dtype: float64

In [25]:
data_filtered['gender'].value_counts()

gender
F         3463
M         3223
Male        27
female      20
Femal       12
Name: count, dtype: int64

In [29]:
def clean_gender(x):
    if x == 'Male':
        return 'M'
    elif x == 'female'or x == 'Femal':
        return 'F'
    else:
        return x

In [30]:
data_filtered['gender'] = list(map(clean_gender, data_filtered['gender']))

/var/folders/2v/nsbsx6y90_9_6kks00t6shb80000gn/T/ipykernel_5855/4282962904.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_filtered['gender'] = list(map(clean_gender, data_filtered['gender']))

In [31]:
data_filtered['gender'].value_counts()

gender
F    3495
M    3250
Name: count, dtype: int64

In [34]:
len(data_filtered[data_filtered['gender'].isna()==True])

98

In [36]:
female_percentage = (data_filtered['gender'] == 'F').sum() / len(data_filtered['gender']) * 100
female_percentage

51.074090311266986

In [37]:
male_percentage = (data_filtered['gender'] == 'M').sum() / len(data_filtered['gender']) * 100
male_percentage

47.49378927371036

In [39]:
# I want to distribute the nulls based on each gender group percentage
def input_gender(data, female_percentage):
    
    total_missing = len(data[data['gender'].isna()])
    female_count = int(female_percentage * total_missing)
    male_count = total_missing - female_count

    female_indices = np.random.choice(data[data['gender'].isna()].index, size=female_count)
    data.loc[female_indices, 'gender'] = 'F'
    data.loc[data['gender'].isna(), 'gender'] = 'M'


input_gender(data_filtered, female_percentage)

In [40]:
data_filtered['gender'].value_counts()

gender
F    3658
M    3185
Name: count, dtype: int64

In [41]:
len(data_filtered[data_filtered['gender'].isna()==True])

0

In [43]:
data_filtered['customer lifetime value'].isna

<bound method Series.isna of 2       12887.431700
4        5363.076500
5        8256.297800
6        5380.898600
8       24127.504000
            ...
7063       50.321655
7064       41.003985
7065      234.059880
7066       30.965112
7068       75.244424
Name: customer lifetime value, Length: 6843, dtype: float64>

In [61]:
marketing = pd.read_csv("Data/marketing_customer_analysis.csv")
marketing.head(3)

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,...,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A

In [48]:
marketing['Effective To Date'] = pd.to_datetime(marketing['Effective To Date'], errors='coerce')
marketing['Effective To Date'][0].day
marketing.month = marketing['Effective To Date'][0].month
marketing['Effective To Date'][0].year

/var/folders/2v/nsbsx6y90_9_6kks00t6shb80000gn/T/ipykernel_5855/2973415254.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  marketing['Effective To Date'] = pd.to_datetime(marketing['Effective To Date'], errors='coerce')

2011

In [54]:
marketing['Effective To Date'] = pd.to_datetime(marketing['Effective To Date'], errors='coerce')
marketing['month'] = marketing['Effective To Date'].dt.strftime('%B')

In [59]:
marketing.head(2)

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type,month,Quarters
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN,February,Q1
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN,January,Q1

In [56]:
# I want to create a new column that states the quarter of the month
def quarters(x):
    Q1 = ['January', 'February', 'March']
    Q2 = ['April', 'May', 'June']
    Q3 = ['July', 'August', 'September']
    Q4 = ['October', 'November', 'December']
    
    x = x.capitalize()
    if x in Q1:
        return 'Q1'
    elif x in Q2:
        return 'Q2'
    elif x in Q3:
        return 'Q3'
    elif x in Q4:
        return 'Q4'
    else:
        return 'Invalid Month'

In [57]:
marketing['Quarters'] = marketing ['month'].apply(quarters)

In [60]:
marketing[marketing['Quarters'] == 'Q1'].head(5) # showing the months of Q1

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type,month,Quarters
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN,February,Q1
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN,January,Q1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,February,Q1
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,January,Q1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN,January,Q1